fio/log/alfs_5th_random_read_log.txt
fio_test: (g=0): rw=randread, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=128
...
fio-2.2.8
Starting 8 threads

fio_test: (groupid=0, jobs=1): err= 0: pid=9655: Fri Jan 27 08:15:55 2017
  read : io=819200MB, bw=80329KB/s, iops=20082, runt=10442762msec
    slat (usec): min=1, max=5708, avg= 2.90, stdev= 1.62
    clat (usec): min=228, max=43967, avg=6370.22, stdev=8184.32
     lat (usec): min=644, max=43971, avg=6373.19, stdev=8184.39
    clat percentiles (usec):
     |  1.00th=[ 1032],  5.00th=[ 1064], 10.00th=[ 1112], 20.00th=[ 1224],
     | 30.00th=[ 1432], 40.00th=[ 1688], 50.00th=[ 2024], 60.00th=[ 2448],
     | 70.00th=[ 3216], 80.00th=[19072], 90.00th=[21632], 95.00th=[22656],
     | 99.00th=[24192], 99.50th=[24448], 99.90th=[25216], 99.95th=[25728],
     | 99.99th=[26240]
    bw (KB  /s): min=50688, max=243536, per=12.51%, avg=80365.53, stdev=8810.02
    lat (usec) : 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.09%
    lat (msec) : 2=49.28%, 4=24.50%, 10=2.95%, 20=6.07%, 50=17.10%
  cpu          : usr=3.80%, sys=7.12%, ctx=172976524, majf=0, minf=129
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=209715200/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128
fio_test: (groupid=0, jobs=1): err= 0: pid=9656: Fri Jan 27 08:15:55 2017
  read : io=819200MB, bw=80422KB/s, iops=20105, runt=10430778msec
    slat (usec): min=1, max=5823, avg= 2.91, stdev= 1.42
    clat (usec): min=67, max=43850, avg=6362.89, stdev=8182.63
     lat (usec): min=698, max=43853, avg=6365.87, stdev=8182.69
    clat percentiles (usec):
     |  1.00th=[ 1032],  5.00th=[ 1064], 10.00th=[ 1112], 20.00th=[ 1224],
     | 30.00th=[ 1432], 40.00th=[ 1688], 50.00th=[ 2024], 60.00th=[ 2448],
     | 70.00th=[ 3216], 80.00th=[19072], 90.00th=[21632], 95.00th=[22656],
     | 99.00th=[24192], 99.50th=[24448], 99.90th=[25216], 99.95th=[25472],
     | 99.99th=[26240]
    bw (KB  /s): min=53328, max=136536, per=12.52%, avg=80455.70, stdev=7794.96
    lat (usec) : 100=0.01%, 500=0.01%, 750=0.01%, 1000=0.09%
    lat (msec) : 2=49.40%, 4=24.46%, 10=2.91%, 20=6.06%, 50=17.09%
  cpu          : usr=3.82%, sys=7.15%, ctx=172857680, majf=0, minf=130
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=209715200/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128
fio_test: (groupid=0, jobs=1): err= 0: pid=9657: Fri Jan 27 08:15:55 2017
  read : io=819200MB, bw=80314KB/s, iops=20078, runt=10444809msec
    slat (usec): min=1, max=5288, avg= 2.91, stdev= 1.50
    clat (usec): min=401, max=43850, avg=6371.46, stdev=8185.13
     lat (usec): min=846, max=43854, avg=6374.43, stdev=8185.20
    clat percentiles (usec):
     |  1.00th=[ 1032],  5.00th=[ 1064], 10.00th=[ 1112], 20.00th=[ 1224],
     | 30.00th=[ 1432], 40.00th=[ 1688], 50.00th=[ 2024], 60.00th=[ 2448],
     | 70.00th=[ 3216], 80.00th=[19072], 90.00th=[21632], 95.00th=[22656],
     | 99.00th=[24192], 99.50th=[24448], 99.90th=[25216], 99.95th=[25728],
     | 99.99th=[26240]
    bw (KB  /s): min=54344, max=357696, per=12.50%, avg=80339.23, stdev=9492.90
    lat (usec) : 500=0.01%, 750=0.01%, 1000=0.09%
    lat (msec) : 2=49.25%, 4=24.53%, 10=2.95%, 20=6.07%, 50=17.11%
  cpu          : usr=3.82%, sys=7.14%, ctx=172819060, majf=0, minf=129
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=209715200/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128
fio_test: (groupid=0, jobs=1): err= 0: pid=9658: Fri Jan 27 08:15:55 2017
  read : io=819200MB, bw=80531KB/s, iops=20132, runt=10416681msec
    slat (usec): min=1, max=6167, avg= 2.91, stdev= 1.48
    clat (usec): min=561, max=43365, avg=6354.29, stdev=8182.05
     lat (usec): min=564, max=43368, avg=6357.27, stdev=8182.12
    clat percentiles (usec):
     |  1.00th=[ 1032],  5.00th=[ 1064], 10.00th=[ 1112], 20.00th=[ 1224],
     | 30.00th=[ 1416], 40.00th=[ 1688], 50.00th=[ 2008], 60.00th=[ 2448],
     | 70.00th=[ 3216], 80.00th=[19072], 90.00th=[21632], 95.00th=[22656],
     | 99.00th=[24192], 99.50th=[24448], 99.90th=[25216], 99.95th=[25472],
     | 99.99th=[26240]
    bw (KB  /s): min=52938, max=114208, per=12.54%, avg=80567.05, stdev=7755.66
    lat (usec) : 750=0.01%, 1000=0.10%
    lat (msec) : 2=49.50%, 4=24.44%, 10=2.85%, 20=6.04%, 50=17.07%
  cpu          : usr=3.82%, sys=7.15%, ctx=172899150, majf=0, minf=129
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=209715200/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128
fio_test: (groupid=0, jobs=1): err= 0: pid=9659: Fri Jan 27 08:15:55 2017
  read : io=819200MB, bw=80462KB/s, iops=20115, runt=10425508msec
    slat (usec): min=1, max=5815, avg= 2.90, stdev= 1.47
    clat (usec): min=535, max=43903, avg=6359.69, stdev=8184.31
     lat (usec): min=879, max=43906, avg=6362.66, stdev=8184.38
    clat percentiles (usec):
     |  1.00th=[ 1032],  5.00th=[ 1064], 10.00th=[ 1112], 20.00th=[ 1224],
     | 30.00th=[ 1416], 40.00th=[ 1688], 50.00th=[ 2008], 60.00th=[ 2448],
     | 70.00th=[ 3216], 80.00th=[19072], 90.00th=[21632], 95.00th=[22656],
     | 99.00th=[24192], 99.50th=[24448], 99.90th=[25216], 99.95th=[25728],
     | 99.99th=[26240]
    bw (KB  /s): min=51802, max=127904, per=12.53%, avg=80498.56, stdev=7829.23
    lat (usec) : 750=0.01%, 1000=0.09%
    lat (msec) : 2=49.48%, 4=24.42%, 10=2.87%, 20=6.04%, 50=17.09%
  cpu          : usr=3.82%, sys=7.12%, ctx=172928304, majf=0, minf=129
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=209715200/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128
fio_test: (groupid=0, jobs=1): err= 0: pid=9660: Fri Jan 27 08:15:55 2017
  read : io=819200MB, bw=80442KB/s, iops=20110, runt=10428127msec
    slat (usec): min=1, max=6277, avg= 2.91, stdev= 1.45
    clat (usec): min=445, max=43753, avg=6361.27, stdev=8182.55
     lat (usec): min=906, max=43756, avg=6364.25, stdev=8182.62
    clat percentiles (usec):
     |  1.00th=[ 1032],  5.00th=[ 1064], 10.00th=[ 1112], 20.00th=[ 1224],
     | 30.00th=[ 1432], 40.00th=[ 1688], 50.00th=[ 2024], 60.00th=[ 2448],
     | 70.00th=[ 3216], 80.00th=[19072], 90.00th=[21632], 95.00th=[22656],
     | 99.00th=[24192], 99.50th=[24448], 99.90th=[25216], 99.95th=[25728],
     | 99.99th=[26240]
    bw (KB  /s): min=54634, max=128725, per=12.53%, avg=80478.17, stdev=7809.72
    lat (usec) : 500=0.01%, 1000=0.09%
    lat (msec) : 2=49.43%, 4=24.42%, 10=2.91%, 20=6.07%, 50=17.07%
  cpu          : usr=3.80%, sys=7.14%, ctx=172926357, majf=0, minf=129
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=209715200/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128
fio_test: (groupid=0, jobs=1): err= 0: pid=9661: Fri Jan 27 08:15:55 2017
  read : io=819200MB, bw=80313KB/s, iops=20078, runt=10444836msec
    slat (usec): min=1, max=5799, avg= 2.91, stdev= 1.53
    clat (usec): min=55, max=42954, avg=6371.48, stdev=8186.43
     lat (usec): min=109, max=42956, avg=6374.46, stdev=8186.49
    clat percentiles (usec):
     |  1.00th=[ 1032],  5.00th=[ 1064], 10.00th=[ 1112], 20.00th=[ 1224],
     | 30.00th=[ 1432], 40.00th=[ 1688], 50.00th=[ 2024], 60.00th=[ 2448],
     | 70.00th=[ 3216], 80.00th=[19072], 90.00th=[21632], 95.00th=[22656],
     | 99.00th=[24192], 99.50th=[24448], 99.90th=[25216], 99.95th=[25472],
     | 99.99th=[26240]
    bw (KB  /s): min=51411, max=370760, per=12.50%, avg=80335.82, stdev=9419.36
    lat (usec) : 100=0.01%, 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.10%
    lat (msec) : 2=49.31%, 4=24.47%, 10=2.94%, 20=6.07%, 50=17.11%
  cpu          : usr=3.80%, sys=7.13%, ctx=172885914, majf=0, minf=130
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=209715200/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128
fio_test: (groupid=0, jobs=1): err= 0: pid=9662: Fri Jan 27 08:15:55 2017
  read : io=819200MB, bw=80398KB/s, iops=20099, runt=10433915msec
    slat (usec): min=1, max=5815, avg= 2.90, stdev= 1.55
    clat (usec): min=101, max=43865, avg=6364.82, stdev=8182.80
     lat (usec): min=592, max=43868, avg=6367.80, stdev=8182.87
    clat percentiles (usec):
     |  1.00th=[ 1032],  5.00th=[ 1064], 10.00th=[ 1112], 20.00th=[ 1224],
     | 30.00th=[ 1432], 40.00th=[ 1688], 50.00th=[ 2024], 60.00th=[ 2448],
     | 70.00th=[ 3216], 80.00th=[19072], 90.00th=[21632], 95.00th=[22656],
     | 99.00th=[24192], 99.50th=[24448], 99.90th=[25216], 99.95th=[25728],
     | 99.99th=[26240]
    bw (KB  /s): min=53787, max=189928, per=12.52%, avg=80432.70, stdev=7880.05
    lat (usec) : 250=0.01%, 750=0.01%, 1000=0.09%
    lat (msec) : 2=49.37%, 4=24.46%, 10=2.93%, 20=6.07%, 50=17.08%
  cpu          : usr=3.81%, sys=7.12%, ctx=172925586, majf=0, minf=129
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=209715200/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
   READ: io=6400.0GB, aggrb=642507KB/s, minb=80313KB/s, maxb=80530KB/s, mint=10416681msec, maxt=10444836msec

Disk stats (read/write):
  nvme0n1: ios=1677676434/163, merge=0/6, ticks=2082424675/4482, in_queue=2109566522, util=100.00%